#define pinOutM
//#define PWMServoM
#define buzzerM
#define TachM
#define A0M
#define rgbM
#define DS18B20M
#define DHTM
#define irM
#define rfM
//#define webSoketM
/* Память при компеляции 4/1
 *
 * 258024 байт (24%) памяти устройства 258024 - Пустой скетч
 * 387216 байт (37%) памяти устройства 129192 - Основные настройки и библиотеки
 * 389332 байт (37%) памяти устройства 2116   - pinOutM
 * 390796 байт (37%) памяти устройства 1464   - buzzerM
 * 392076 байт (37%) памяти устройства 1280   - TachM
 * 418352 байт (40%) памяти устройства 26276  - irM
 * 438624 байт (41%) памяти устройства 20272  - rgbM
 * 440788 байт (42%) памяти устройства 2164   - A0M
 * 445368 байт (42%) памяти устройства 4580   - DS18B20M
 * 446796 байт (42%) памяти устройства 1428   - DHTM
 * 452688 байт (43%) памяти устройства 5892   - PWMServoM
 * 454744 байт (43%) памяти устройства 2056   - rfM
 * 580388 байт (55%) памяти устройства 125644 - webSoketM
 *
 * 258024 байт (24%) памяти устройства - Пустой скетч
 * 288540 байт (27%) памяти устройства - Основные библиотеки занимают
 * 288648 байт (27%) памяти устройства - Глобальные строки
 * 288828 байт (27%) памяти устройства - Json обработка
 * 315088 байт (30%) памяти устройства - Main обработка
 * 328956 байт (31%) памяти устройства - CMD общие комманды
 * 338772 байт (32%) памяти устройства - Старый код WiFi
 * 347832 байт (33%) памяти устройства - Новый код WiFi и Web
 * 354216 байт (33%) памяти устройства - Web Сервер + Puls
 * 369108 байт (35%) памяти устройства - Upgrade
 * 369108 байт (35%) памяти устройства - Timers
 * 369108 байт (35%) памяти устройства - NTP
 * 383576 байт (36%) памяти устройства - SSDP
 * 387184 байт (37%) памяти устройства - Scenary
 * 389308 байт (37%) памяти устройства - pinOutM
 * 390732 байт (37%) памяти устройства - buzzerM
 * 392012 байт (37%) памяти устройства - TachM
 * 418568 байт (40%) памяти устройства - irM
 * 436700 байт (41%) памяти устройства - rgbM
 * 560744 байт (53%) памяти устройства - webSoketM
 * 439696 байт (42%) памяти устройства - A0M
 * 444292 байт (42%) памяти устройства - DS18B20M
 * 445736 байт (42%) памяти устройства - DHTM
 * 569856 байт (54%) памяти устройства - webSoketM
 *
 *
 */
